# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.00  # scales module repeats
width_multiple: 1.00 # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [512, 3, 2]]  #0 3-P3/8 
  - [-1, 6, C2f, [256, True]] #1
  - [-1, 1, Conv, [1024, 3, 2]]  #2 5-P4/16
  - [-1, 6, C2f, [512, True]] #3
  - [-1, 1, Conv, [1024, 3, 2]]  #4 7-P5/32
  - [-1, 3, C2f, [1024, True]] #5
  - [-1, 1, SPPF, [1024, 5]]  #6


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  #7
  - [[-1, 3], 1, Concat, [1]]  #8 cat backbone P4
  - [-1, 3, C2f, [512]]  # 9

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #10
  - [[-1, 1], 1, Concat, [1]]  #11 cat backbone P3
  - [-1, 3, C2f, [256]]  # 12 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] #13
  - [[-1, 9], 1, Concat, [1]]  #14 cat head P4
  - [-1, 3, C2f, [512]]  # 15 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] #16
  - [[-1, 6], 1, Concat, [1]]  #17 cat head P5
  - [-1, 3, C2f, [1024]]  #18 (P5/32-large)

  - [[12, 15, 18], 1, Detect, [nc]]  # Detect(P3, P4, P5)
